{
    "text":
    [
        {
            "elementid":"pagetitle",
            "text":"SiguemeORG"
        },
        {
            "elementid":"functional-title",
            "text":"System functional requirements"
        },
        {
            "elementid":"nonfunctional-title",
            "text":"System non-functional requirements"
        },
        {
            "elementid":"nonfunctional-subtitle1",
            "text":"Interfaces de usuario"
        },
        {
            "elementid":"nonfunctional-subtitle2",
            "text":"Interfaces de comunicación"
        },
        {
            "elementid":"nonfunctional-subtitle3",
            "text":"Requisitos de desempeño"
        },
        {
            "elementid":"nonfunctional-subtitle4",
            "text":"Seguridad"
        },
        {
            "elementid":"nonfunctional-subtitle5",
            "text":"Portabilidad"
        },
        {
            "elementid":"nonfunctional-subtitle6",
            "text":"Mantenibilidad"
        },
        {
            "elementid":"functional-date",
            "text":"May 13nd"
        },
        {
            "elementid":"functional-item1",
            "text":"The system should allow donations through digital cryptocurrencies and other traditional currencies, generating more possibilities for the donor regarding the transaction."
        },
        {
            "elementid":"functional-item2",
            "text":"The system must allow the management of users and the agregation of entities in order to guarantee the appropriate roles."
        },
        {
            "elementid":"functional-item3",
            "text":"The system must allow the management of entities and projects."
        },
        {
            "elementid":"functional-item4",
            "text":"The system must allow the visualization of purchases and donations."
        },
        {
            "elementid":"functional-item1-subitem1",
            "text":"If an user wants to make a donation, the system should not force him to register in order to carry out the transaction (anonymous donor)."
        },
        {
            "elementid":"functional-item1-subitem2",
            "text":"Anyone must be able to see project activities and transactions information, the system is public."
        },
        {
            "elementid":"functional-item2-subitem1",
            "text":"When an anonymous user enters the app, it must allow access to all its functions but must not allow --- to manage personal information."
        },
        {
            "elementid":"functional-item2-subitem2",
            "text":"At the time of login, the system must allow the user to enter through the gmail account to facilitate the registration process."
        },
        {
            "elementid":"functional-item2-subitem3",
            "text":"At any time a user wants, he must be able to follow the flow of a project, such as accessing, seeing its description, seeing the funds it has received, how much has been spent, how much it keeps, the transactions it has made with the funds and photos of the activities (optional), in order to generate good feelings in the donors."
        },
        {
            "elementid":"functional-item2-subitem4",
            "text":"The system should require validation from the organization prior to creating a project, to ensure that the organizations create the projects."
        },
        {
            "elementid":"functional-item3-subitem1",
            "text":"The duration of a project should not be more than one year. Given the above, when the time is up, the project will stop being in implementation mode and will go into historical mode."
        },
        {
            "elementid":"functional-item3-subitem2",
            "text":"In any situation, users should have the option to share the projects on their social networks to attract the attention of more donors."
        },
        {
            "elementid":"functional-item3-subitem3",
            "text":"When creating a new project, the entity must establish an economic goal, which can be exceeded, but serves as a reference to see the growth of donations."
        },
        {
            "elementid":"functional-item4-subitem1",
            "text":"The user can only read or view the information but cannot alter it. It should be considered that the information can be copied or printed."
        },
        {
            "elementid":"nonfunctional-item1-subitem1",
            "text":"El flujo de la aplicación debe ser intuitivo para el usuario, el despliegue frente a este debe ser eficiente."
          },
          {
            "elementid":"nonfunctional-item1-subitem2",
            "text":"Los componentes de diseño deberán permitir mostrar la información de manera dinámica, ágil y estética."
          },
          {
            "elementid":"nonfunctional-item1-subitem3",
            "text":"El navegador no debe requerir la instalación de plugins o applets para que el software funcione, ni requerir soporte al usuario para poder operar la aplicación."
          },
          {
            "elementid":"nonfunctional-item3-subitem1",
            "text":"Los tiempos de respuesta relacionados con formularios de procesamiento de información no deben superar los 4 segundos."
          },
          {
            "elementid":"nonfunctional-item3-subitem2",
            "text":"El 90% de los procesos relacionados con respuestas de transacciones no deberá exceder tiempos de respuesta de 4 segundos.                "
          },
          {
            "elementid":"nonfunctional-item3-subitem3",
            "text":"Los tiempos de confirmación de transacciones estarán ligados directamente a la manera de donar, aquí se deja muestra de este ítem:"
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem1",
            "text":"Sí se utiliza bitcoin podrá tardar lo que demore el consenso de los participantes en la red."
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2",
            "text":"Sí se utiliza uphold para realizar donaciones los tiempos de confirmación son los siguientes :"
          },
          {
            "type":"p",
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem1",
            "text":"Transferencia bancaria de 5-7 días "
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem2",
            "text":"Tarjeta de débito hasta 24 horas "
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem3",
            "text":"Tarjeta de crédito  hasta 24 horas"
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem4",
            "text":"Criptomonedas aproximadamente 20-30 min."
          },
          {
            "elementid":"nonfunctional-item4-subitem1",
            "text":" Para realizar transacciones con moneda bitcoin cada usuario es responsable de tener la clave privada de su monedero y la clave pública del proyecto y deberá realizar copia de seguridad a estas (Responsabilidad de usuario). "
          },
          {
            "elementid":"nonfunctional-item5-subitem1",
            "text":"Se debe garantizar que la aplicación sea multiplataforma (Android,IOS)."
          },
          {
            "elementid":"nonfunctional-item6-subitem1",
            "text":"Documentación: se debe especificar la definición y el manejo de la documentación técnica (manuales técnicos ) y funcional (manuales de configuración y de usuario final) del sistema de información, establecer procedimientos claros de actualización y aprobación."
          },
          {
            "elementid":"principal-nav-title",
            "text":"Principal"
          },
          {
            "elementid":"requirements-nav-title",
            "text":"About system"
          },
          {
            "elementid":"complements-nav-title",
            "text":"Complements"
          },
          {
            "elementid":"requirements-nav-list",
            "text":"Requeriments"
          },
          {
            "elementid":"diagrams-nav-list",
            "text":"Diagrams"
          },
          {
            "elementid":"formats-nav-list",
            "text":"UMB Formats"
          },
          {
            "elementid":"firsttrigger",
            "text":"Home"
          },
          {
            "elementid":"secondtrigger",
            "text":"Functional"
          },
          {
            "elementid":"thirdtrigger",
            "text":"Non-Functional"
          },
          {
            "elementid":"tenthtrigger",
            "text":"Use Cases"
          },
          {
            "elementid":"eleventhtrigger",
            "text":"Givi001"
          },
          {
            "elementid":"twelvethtrigger",
            "text":"Givi010"
          },
          {
            "elementid":"usecase-title",
            "text":"Use Cases"
          },
          {
            "elementid":"siguemeorg-title",
            "text":"SiguemeORG"
          },
          {
            "elementid":"what",
            "text":"SiguemeORG is an idea that born to improve the donations trazability, we could help, we could build a better world."
          },
          {
            "elementid":"why",
            "text":"Nobody says that this life is easy, Some of us have had better opportunities than others. ¡Help those others with this app!."
          },
          {
            "elementid":"how",
            "text":"Using blockchain we will can show the donation money destination, this is the new wave!"
          }
    ]
}