{
    "text":
    [
        {
            "elementid":"pagetitle",
            "text":"SiguemeORG"
        },
        {
            "elementid":"functional-title",
            "text":"Requisitos funcionales del sistema"
        },
        {
            "elementid":"nonfunctional-title",
            "text":"Requisitos no funcionales del sistema"
        },
        {
            "elementid":"nonfunctional-subtitle1",
            "text":"Interfaces de usuario"
        },
        {
            "elementid":"nonfunctional-subtitle2",
            "text":"Interfaces de comunicación"
        },
        {
            "elementid":"nonfunctional-subtitle3",
            "text":"Requisitos de desempeño"
        },
        {
            "elementid":"nonfunctional-subtitle4",
            "text":"Seguridad"
        },
        {
            "elementid":"nonfunctional-subtitle5",
            "text":"Portabilidad"
        },
        {
            "elementid":"nonfunctional-subtitle6",
            "text":"Mantenibilidad"
        },
        {
            "elementid":"functional-date",
            "text":"Mayo 13"
        },
        {
            "elementid":"functional-item1",
            "text":"El sistema deberá permitir donaciones mediante criptomonedas digitales y otras monedas tradicionales, generando al donante más posibilidades referentes a la transacción."
        },
        {
            "elementid":"functional-item2",
            "text":"El sistema debe  permitir la gestión de donantes y organizaciones con el fin de garantizar los roles adecuados."
        },
        {
            "elementid":"functional-item3",
            "text":"El sistema deberá permitir la gestión de causas que actuarán como representación digital de las obras sociales."
        },
        {
            "elementid":"functional-item4",
            "text":"El sistema debe permitir la visualización del histórico de operaciones al interior de las causas (proyectos), con el fin de generar empatía con el donante."
        },
        {
            "elementid":"functional-item1-subitem1",
            "text":"Si un usuario requiere hacer una donación, entonces el sistema deberá obligarle a registrarse para poder realizar la transacción."
        },
        {
            "elementid":"functional-item1-subitem2",
            "text":"Ejecución: este acceso otorga al usuario el privilegio de ejecutar transacciones, opciones o módulos."
        },
        {
            "elementid":"functional-item2-subitem1",
            "text":"Cuando un usuario nuevo que no esté registrado ingrese al sistema, este deberá permitirle acceder todas las funciones del sistema pero no deberá permitirle realizar donaciones."
        },
        {
            "elementid":"functional-item2-subitem2",
            "text":"En el momento del registro, el sistema debe permitir al usuario registrarse mediante la cuenta de correo de gmail, o facebook para facilitar el proceso de registro."
        },
        {
            "elementid":"functional-item2-subitem3",
            "text":"En el momento que desee un usuario debe poder seguir el flujo de un proyecto, como por ejemplo, acceder, ver su descripción, ver los fondos que ha recibido, cuanto se ha gastado, cuánto conserva, las transacciones que ha realizado con los fondos y fotos de las actividades(opcional), con el fin de generar buenas sensaciones en los donantes."
        },
        {
            "elementid":"functional-item2-subitem4",
            "text":"El sistema deberá exigir la validación de la organización previo a crear un proyecto, para garantizar que sean las organizaciones quienes creen los proyectos."
        },
        {
            "elementid":"functional-item3-subitem1",
            "text":"La duración de un proyecto no debe ser mayor a un año. Dado lo anterior, cuando se cumpla el tiempo, el proyecto dejará de estar en modo implementación y pasará a modo histórico."
        },
        {
            "elementid":"functional-item3-subitem2",
            "text":"En cualquier situación los usuarios deberán tener la opción de compartir los proyectos en sus redes sociales para cautivar la atención de más donantes.  "
        },
        {
            "elementid":"functional-item3-subitem3",
            "text":"Al momento de crear un proyecto nuevo, la entidad debe establecer una meta económica, la cual puede ser superada, pero sirve de referencia para ver el crecimiento de las donaciones."
        },
        {
            "elementid":"functional-item4-subitem1",
            "text":"Lectura: el usuario puede únicamente leer o visualizar la información pero no puede alterarla. Debe considerarse que la información puede ser copiada o impresa."
        },
        {
            "elementid":"nonfunctional-item1-subitem1",
            "text":"El flujo de la aplicación debe ser intuitivo para el usuario, el despliegue frente a este debe ser eficiente."
          },
          {
            "elementid":"nonfunctional-item1-subitem2",
            "text":"Los componentes de diseño deberán permitir mostrar la información de manera dinámica, ágil y estética."
          },
          {
            "elementid":"nonfunctional-item1-subitem3",
            "text":"El navegador no debe requerir la instalación de plugins o applets para que el software funcione, ni requerir soporte al usuario para poder operar la aplicación."
          },
          {
            "elementid":"nonfunctional-item3-subitem1",
            "text":"Los tiempos de respuesta relacionados con formularios de procesamiento de información no deben superar los 4 segundos."
          },
          {
            "elementid":"nonfunctional-item3-subitem2",
            "text":"El 90% de los procesos relacionados con respuestas de transacciones no deberá exceder tiempos de respuesta de 4 segundos.                "
          },
          {
            "elementid":"nonfunctional-item3-subitem3",
            "text":"Los tiempos de confirmación de transacciones estarán ligados directamente a la manera de donar, aquí se deja muestra de este ítem:"
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem1",
            "text":"Sí se utiliza bitcoin podrá tardar lo que demore el consenso de los participantes en la red."
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2",
            "text":"Sí se utiliza uphold para realizar donaciones los tiempos de confirmación son los siguientes :"
          },
          {
            "type":"p",
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem1",
            "text":"Transferencia bancaria de 5-7 días "
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem2",
            "text":"Tarjeta de débito hasta 24 horas "
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem3",
            "text":"Tarjeta de crédito  hasta 24 horas"
          },
          {
            "elementid":"nonfunctional-item3-subitem3-subitem2-subitem4",
            "text":"Criptomonedas aproximadamente 20-30 min."
          },
          {
            "elementid":"nonfunctional-item4-subitem1",
            "text":" Para realizar transacciones con moneda bitcoin cada usuario es responsable de tener la clave privada de su monedero y la clave pública del proyecto y deberá realizar copia de seguridad a estas (Responsabilidad de usuario). "
          },
          {
            "elementid":"nonfunctional-item5-subitem1",
            "text":"Se debe garantizar que la aplicación sea multiplataforma (Android,IOS)."
          },
          {
            "elementid":"nonfunctional-item6-subitem1",
            "text":"Documentación: se debe especificar la definición y el manejo de la documentación técnica (manuales técnicos ) y funcional (manuales de configuración y de usuario final) del sistema de información, establecer procedimientos claros de actualización y aprobación."
          },
          {
            "elementid":"principal-nav-title",
            "text":"Principal"
          },
          {
            "elementid":"requirements-nav-title",
            "text":"Acerca del sistema"
          },
          {
            "elementid":"complements-nav-title",
            "text":"Complementos"
          },
          {
            "elementid":"requirements-nav-list",
            "text":"Requerimentos"
          },
          {
            "elementid":"diagrams-nav-list",
            "text":"Diagramas"
          },
          {
            "elementid":"formats-nav-list",
            "text":"Formatos"
          },
          {
            "elementid":"firsttrigger",
            "text":"Ante-proyecto"
          },
          {
            "elementid":"secondtrigger",
            "text":"Funcionales"
          },
          {
            "elementid":"thirdtrigger",
            "text":"No funcionales"
          },
          {
            "elementid":"tenthtrigger",
            "text":"Casos de uso"
          },
          {
            "elementid":"eleventhtrigger",
            "text":"Givi001"
          },
          {
            "elementid":"twelvethtrigger",
            "text":"Givi010"
          },
          {
            "elementid":"usecase-title",
            "text":"Casos de uso"
          },
          {
            "elementid":"siguemeorg-title",
            "text":"SiguemeORG"
          },
          {
            "elementid":"justification",
            "text":"Pensamos que blockchain, con sus pilares de transparencia, inmutabilidad y distribución, puede ofrecer mayor confianza a los donantes que destinan fondos a los proyectos solidarios. Según la ONG Unicef persiste la mutilación genital femenina y existen alrededor de 121 millones de niños, niñas y jóvenes que no han asistido a la escuela y requieren auxilio. Debido a esto y al evidenciar que, en la ciudad de Bogotá no existe actualmente un sistema con las ventajas que proponemos para estas organizaciones la motivación crece. Además, el enfoque de aportar a una causa social anima a llevar a cabo la investigación y es por eso que es pertinente una solución blockchain que ofrezca la posibilidad de motivar a los donantes. de la misma manera en Colombia es difícil encontrar información clara sobre las donaciones, lo que conlleva a pensar en dos situaciones. La cantidad de donantes es reducida para tomar datos estadísticos, o, por otro lado, no hay trazabilidad de las transacciones. Por último, entendiendo que nuestro estudio tiene como meta realizar veeduría de transacciones, esta puede ser la prueba piloto para investigaciones futuras."
          },
          {
            "elementid":"objective-subtitle",
            "text":"Objetivo general"
          },
          {
            "elementid":"specificobjective-subtitle",
            "text":"Objetivos especificos"
          },
          {
            "elementid":"objective-subitem",
            "text":"Implementar una aplicación utilizando la tecnología blockchain que permita evidenciar la trazabilidad de las donaciones consignadas a entidades del tercer sector en la ciudad de Bogotá con el fin de ejercer veeduría sobre las mismas. "
          },
          {
            "elementid":"specificobjective-subitem1",
            "text":"Determinar los requerimientos necesarios para el funcionamiento del sistema, como los tipos de donaciones, o la recurrencia de los donantes, entre otros."
          },
          {
            "elementid":"specificobjective-subitem2",
            "text":"Diseñar la estructura de la aplicación teniendo en cuenta los aspectos técnicos y funcionales requeridos, para ello, la utilización de estilos arquitectónicos, metodologías de desarrollo y patrones de diseño que nos permitan medir la calidad de la aplicación en términos de las métricas del software."
          },
          {
            "elementid":"specificobjective-subitem3",
            "text":"Implementar el diseño planteado, valiéndose de buenas prácticas de desarrollo y de esta manera emplear las bases prácticas de nuestro proceso de aprendizaje."
          },
          {
            "elementid":"specificobjective-subitem4",
            "text":"Validar la funcionalidad de la aplicación como solución del problema planteado en al menos dos escenarios de prueba."
          },
          {
            "elementid":"state-of-art",
            "text":"El objetivo de realizar una donación a una entidad no gubernamental (ONG), es financiar la realización de actividades sociales de valor. Por esta razón, como lo proponen algunos investigadores de la Federación Antioqueña de ONG (Aguilar Rodríguez, Ramírez García and Rocha Valencia, 2019) “el compromiso que se debe acoger por parte de estos grupos de interés debe iniciar con una política de responsabilidad social, dentro de la cual destaca el principio de transparencia” (p. 28), principio que resalta la capacidad de un sujeto para acceder a toda la información relacionada con los datos y decisiones que lo afectan (Bertino, Kundu and Sura, 2019). De esta manera se pretende impulsar a futuro la imagen corporativa de estas organizaciones, resaltando el interés de nuevos voluntarios (Aguilar Rodríguez, Ramírez García and Rocha Valencia, 2019). Agregando a lo mencionado anteriormente, (Bertino, Kundu and Sura, 2019) señala que “ la transparencia de los datos es crítica en esta era de grandes datos y el uso masivo de técnicas de aprendizaje profundo. El uso incorrecto de datos y algoritmos puede conducir a la discriminación, decisiones equivocadas y otros efectos adversos” (p. 8). En efecto, lo anterior conlleva a pensar en la tecnología Blockchain, dado que, esta podría facilitar el seguimiento de los datos y cómo evolucionan en el tiempo (Bertino, Kundu and Sura, 2019). Un ejemplo de aplicación comercial que se ha estado desarrollando actualmente, como lo menciona (Crosby et al., 2016) son dos startups que progresan con Blockchain, Factom y Everledger. El objetivo de Factom es proteger los datos. La compañía participa en el proyecto de registro controlado de tierras hondureño, también en china ofreciendo soluciones de tecnología financiera y servicios de notarización electrónica de datos para mejorar la integridad, (Crosby et al., 2016) . Por otra parte, Leanne Kemp, fundadora y CEO de Everledger también citada por (Crosby et al., 2016) agrega que el objetivo final de esta compañía es rastrear los diamantes desde la mina hasta el mercado, para que los consumidores puedan ver si se han pagado los derechos e impuestos correctos y si un diamante es un ‘diamante de sangre’ que se ha extraído y comercializado en una zona de guerra y ha contribuido con la atrocidad humana (p. 16), sin olvidar que la tecnología Blockchain es originalmente el nombre dado al diseño que sustenta el funcionamiento de la moneda digital Bitcoin, la cual ha registrado con precisión más de 140 millones de transacciones en casi ocho años (Ammous, 2016). Dichas aplicaciones, aunque no se relacionan directamente con el contexto de las donaciones, si representan los lineamientos y los casos de éxito que sirven como punto de referencia para construir sistemas de veeduría. En conjunción (Maldonado, 2018) menciona que se puede ver cómo la tecnología Blockchain es una opción para solucionar los principales problemas a los que se enfrentan los proyectos solidarios, ONG’s, Fundaciones, o entidades sin ánimo de lucro (p. 50). En contraste (Fuertes Paniagua, 2018) concluye que Blockchain puede tener un impacto mayor en una multinacional que en una organización local. Por aspectos tales como la problemática de hacer llegar el dinero a personas que no disponen de una cuenta bancaria, o la versatilidad de proyectos en los que éstas están involucradas. (p. 65). Agrega seguidamente (Fuertes Paniagua, 2018) lo siguiente. En este sentido, Blockchain, con su base de datos pública y cuyas transacciones se actualizan de manera casi inmediata, permite al donante realizar un seguimiento completo de sus donaciones, al mismo tiempo que otorga mayor transparencia a las entidades que lo implementan. (p. 66) Por último (Fuertes Paniagua, 2018) agrega, “Esta tecnología no solo puede conseguir aumentar la confianza del donante en el tercer sector, sino también incrementar su implicación en las causas benéficas a las que aporta dinero”. Fortaleciendo lo anterior (Maldonado, 2018) aclara que, “el donante no solo sabrá que sus fondos están llegando a buen puerto, si no que también sabrá a dónde concretamente. Además podría crear una fidelidad de donación con la ONG” (p. 49). Algunos ejemplos que sustentan lo dicho son los siguientes:"
            
          }
    ]
}